app/Controllers/CarritoController.php

INSERT INTO `carrito` (`id_usuario`, `id_producto`, `cantidad`) VALUES ('1', '14', 1)
---
            $carritoModel->save($existente);
         } else {
            // Insertar nuevo solo con los campos válidos
            $carritoModel->insert([
               'id_usuario'  => $usuarioId,
               'id_producto' => $producto['id_producto'],
               'cantidad'    => $cantidad
            ]);

SELECT *
FROM `carrito`
WHERE `id_usuario` = '4'
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '9'
---
   public function verCarrito()
   {
      $items = [];

      if (!session()->get('logged_in')) {
         // Usuario NO logueado → obtener del carrito en sesión
         $cart = \Config\Services::cart();
         $items = $cart->contents();
      } else {
         // Usuario logueado → obtener desde DB
         $carritoModel = new CarritoModel();
         $productoModel = new ProductosModel();
         $usuarioId = session()->get('id_usuario');

         // Traer los items del carrito (solo contiene id_producto y cantidad)
         $carrito = $carritoModel->where('id_usuario', $usuarioId)->findAll();

         foreach ($carrito as $item) {
            // Obtener el producto asociado
            $producto = $productoModel->find($item['id_producto']);