app/Controllers/ConsultasController.php

    public function verConsultas()
    {
        $consultaModel = new ConsultasModel();
        $consultas = $consultaModel->findAll();
---
SELECT *
FROM `consultas`