app/Controllers/FacturaController.php

    public function ver($id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/');
        }

        $facturaModel = new FacturaModel();

        // Traer la factura junto con el nombre del cliente
        $factura = $facturaModel
            ->select('factura.*, usuarios.nombre as nombre_cliente')
            ->join('usuarios', 'usuarios.id_usuario = factura.id_usuario')
            ->where('factura.id_factura', $id)
            ->first();

        if (!$factura) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Factura no encontrada.');
        }

        $usuarioActual = session()->get('id_usuario');
        if ($usuarioActual !== $factura['id_usuario']) {
            return redirect()->back()->with('error', 'No tienes accesso a esa factura');
        }

        $detalleModel = new DetalleFacturaModel();
        $detalles = $detalleModel
            ->select('detallefactura.*, productos.nombre as nombre_producto, productos.precio as precio_unitario')
            ->join('productos', 'productos.id_producto = detallefactura.id_producto')
            ->where('detallefactura.id_factura', $id)
            ->findAll();
---
SELECT `factura`.*, `usuarios`.`nombre` as `nombre_cliente`
FROM `factura`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `factura`.`id_usuario`
WHERE `factura`.`id_factura` = '15'
 LIMIT 1
SELECT `detallefactura`.*, `productos`.`nombre` as `nombre_producto`, `productos`.`precio` as `precio_unitario`
FROM `detallefactura`
JOIN `productos` ON `productos`.`id_producto` = `detallefactura`.`id_producto`
WHERE `detallefactura`.`id_factura` = '15'

    public function finalizarCompra()
    {
        $usuarioId = session()->get('id_usuario');

        $carritoModel = new CarritoModel();
        $facturaModel = new FacturaModel();
        $detalleFacturaModel = new DetalleFacturaModel();
        $productoModel = new ProductosModel();

        //Traer los ítems del carrito
        $items = $carritoModel
            ->select('carrito.*, productos.precio as precio_unitario, productos.stock as stock_actual')
            ->join('productos', 'productos.id_producto = carrito.id_producto')
            ->where('carrito.id_usuario', $usuarioId)
            ->findAll();
---
SELECT `carrito`.*, `productos`.`precio` as `precio_unitario`, `productos`.`stock` as `stock_actual`
FROM `carrito`
JOIN `productos` ON `productos`.`id_producto` = `carrito`.`id_producto`
WHERE `carrito`.`id_usuario` = '4'

        }

        //Insertar la factura
        $idFactura = $facturaModel->insert([
            'id_usuario' => $usuarioId,
            'fecha_factura' => date('Y-m-d H:i:s'),
            'total' => $total,
        ]);

        // Insertar los detalles y actualizar stock
        foreach ($items as $item) {
            $detalleFacturaModel->insert([
                'id_factura' => $idFactura,
                'id_producto' => $item['id_producto'],
                'cantidad' => $item['cantidad'],
                'subtotal' => $item['cantidad'] * $item['precio_unitario'],
            ]);
---
INSERT INTO `factura` (`id_usuario`, `fecha_factura`, `total`) VALUES ('4', '2025-06-24 22:05:38', 130000)
INSERT INTO `detallefactura` (`id_factura`, `id_producto`, `cantidad`, `subtotal`) VALUES (15, '13', '1', 130000)

            }

            // Actualizar el producto
            $productoModel->update($item['id_producto'], $datosActualizacion);
        }

        //Vaciar el carrito del usuario
        $carritoModel->where('id_usuario', $usuarioId)->delete();
---
UPDATE `productos` SET `stock` = 598
WHERE `productos`.`id_producto` IN ('13')
DELETE FROM `carrito`
WHERE `id_usuario` = '4'