app/Controllers/Home.php

    public function index()
{
    $productosModel = new \App\Models\ProductosModel();
    $data['productos'] = $productosModel->findAll(); // o un subset como productos destacados
---
SELECT *
FROM `productos`