app/Controllers/ProductosController.php

SELECT *
FROM `productos`
WHERE `activo` = 1
---
    public function index()
    {
        $productoModel = new ProductosModel();

        $resultado = $productoModel->where('activo', 1)->findAll(); // devuelve cada uno de los productos de array

INSERT INTO `productos` (`nombre`, `descripcion`, `precio`, `stock`, `url_imagen`, `activo`, `categoria`) VALUES ('lentes', 'a', '3000', '6', 'public/uploads/productos/1750439469_b5b9f4ffebed3c68bc4d.jpg', 1, '1')
---

        $post = $this->request->getPost(['nombre', 'descripcion', 'precio', 'stock', 'categoria']);

        $productoModel->insert([
            'nombre' => trim($post['nombre']),
            'descripcion' => trim($post['descripcion']),
            'precio' => $post['precio'],
            'stock' => $post['stock'],
            'url_imagen' => $rutaImagen,
            'activo' => 1, // si usás un campo activo
            'categoria' => $post['categoria']
        ]);