app/Controllers/UsuariosController.php

            'busquedaFactura' => $busquedaFactura,
            'busquedaUsuarios' => $busquedaUsuarios,

            'totalUsuarios' => $usuarioModel->countAll(),
            'totalFacturas' => $facturaModel->countAll(),
            'totalVentas' => $facturaModel->selectSum('total')->first()['total'] ?? 0,

            'usuariosActivados' => $usuarioModel->where('activo', 1)->findAll(),
            'usuariosDesactivados' => $usuarioModel->where('activo', 0)->findAll()
---
SELECT COUNT(*) AS `numrows` FROM `usuarios`
SELECT COUNT(*) AS `numrows` FROM `factura`
SELECT SUM(`total`) AS `total`
FROM `factura`
 LIMIT 1
SELECT *
FROM `usuarios`
WHERE `activo` = 1
SELECT *
FROM `usuarios`
WHERE `activo` = 0