app/Controllers/UsuariosController.php

    public function crear()
    {
        //reglas
        $rules = [

            'nombre' => 'required|max_length[50]',
            'apellido' => 'required|max_length[50]',
            'domicilio' => 'required|max_length[255]',
            'email' => 'required|max_length[100]|valid_email|is_unique[usuarios.email]',
            'pass' => 'required|max_length[100]|min_length[5]',
            'repassword' => 'matches[pass]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->listErrors());
        }

        $usuariosModel =  new UsuariosModel();
        $post = $this->request->getPost(['nombre', 'apellido', 'domicilio', 'email', 'pass',]);

        $usuariosModel->insert([
            'nombre' => $post['nombre'],
            'apellido' => $post['apellido'],
            'domicilio' => $post['domicilio'],
            'email' => $post['email'],
            'pass' => password_hash($post['pass'], PASSWORD_DEFAULT),
            'rol' => 2,
            'activo' => 1
        ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `domicilio`, `email`, `pass`, `rol`, `activo`) VALUES ('aaaaaaaaaaa', 'ggggggggggg', 'av 3 de abril', 'a@gmail.com', '$2y$10$DIuhfY6FLTceQV2WBpuKA.Vzu1.Cn8ZyRhkHvDtsX.7ID3HDweE7.', 2, 1)

    public function dashboard()
    {
        $usuarioModel = new UsuariosModel();
        $facturaModel = new FacturaModel();
        $detalleModel = new DetalleFacturaModel();

        $data = [
            'totalUsuarios' => $usuarioModel->countAll(),
            'totalFacturas' => $facturaModel->countAll(),
            'totalVentas' => $facturaModel->selectSum('total')->first()['total'] ?? 0,
            'facturas' => $facturaModel->orderBy('fecha_factura', 'DESC')->limit(5)->findAll(),
            'usuariosActivados' =>  $usuarioModel->where('activo', 1)->findAll(),
            'usuariosDesactivados' =>  $usuarioModel->where('activo', 0)->findAll()

        ];
---
SELECT COUNT(*) AS `numrows` FROM `usuarios`
SELECT COUNT(*) AS `numrows` FROM `factura`
SELECT SUM(`total`) AS `total`
FROM `factura`
 LIMIT 1
SELECT *
FROM `factura`
ORDER BY `fecha_factura` DESC
 LIMIT 5
SELECT *
FROM `usuarios`
WHERE `activo` = 1