app/Models/UsuariosModel.php

 public function validarUsuario($email, $pass){
    $email = $this->where(['email' => $email, 'activo' => 1])->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'claragomez968@gmail.com'
AND `activo` = 1
 LIMIT 1