app/Models/UsuariosModel.php

 public function validarUsuario($email, $pass)
    {
        $usuario = $this->select('id_usuario, email, pass, nombre, rol')
                        ->where(['email' => $email, 'activo' => 1])
                        ->first();
---
SELECT `id_usuario`, `email`, `pass`, `nombre`, `rol`
FROM `usuarios`
WHERE `email` = 'admin@mail.com'
AND `activo` = 1
 LIMIT 1